MikroElektronika/core_packages/ARM/gcc_clang/def/stm/STM32F301K8/mcu.h
/***************  Bit definition for ADC1_COMMON_CDR register  ***************/
#define ADC1_CDR_RDATA_MST_Pos          (0U)                                   
#define ADC1_CDR_RDATA_MST_Msk          (0xFFFFUL << ADC1_CDR_RDATA_MST_Pos)    /*!< 0x0000FFFF */
#define ADC1_CDR_RDATA_MST              ADC1_CDR_RDATA_MST_Msk                 /*!< Regular Data of the master ADC */
#define ADC1_CDR_RDATA_MST_0            (0x0001UL << ADC1_CDR_RDATA_MST_Pos)    /*!< 0x00000001 */
#define ADC1_CDR_RDATA_MST_1            (0x0002UL << ADC1_CDR_RDATA_MST_Pos)    /*!< 0x00000002 */
#define ADC1_CDR_RDATA_MST_2            (0x0004UL << ADC1_CDR_RDATA_MST_Pos)    /*!< 0x00000004 */
#define ADC1_CDR_RDATA_MST_3            (0x0008UL << ADC1_CDR_RDATA_MST_Pos)    /*!< 0x00000008 */
#define ADC1_CDR_RDATA_MST_4            (0x0010UL << ADC1_CDR_RDATA_MST_Pos)    /*!< 0x00000010 */
#define ADC1_CDR_RDATA_MST_5            (0x0020UL << ADC1_CDR_RDATA_MST_Pos)    /*!< 0x00000020 */
#define ADC1_CDR_RDATA_MST_6            (0x0040UL << ADC1_CDR_RDATA_MST_Pos)    /*!< 0x00000040 */
#define ADC1_CDR_RDATA_MST_7            (0x0080UL << ADC1_CDR_RDATA_MST_Pos)    /*!< 0x00000080 */
#define ADC1_CDR_RDATA_MST_8            (0x0100UL << ADC1_CDR_RDATA_MST_Pos)    /*!< 0x00000100 */
#define ADC1_CDR_RDATA_MST_9            (0x0200UL << ADC1_CDR_RDATA_MST_Pos)    /*!< 0x00000200 */
#define ADC1_CDR_RDATA_MST_10           (0x0400UL << ADC1_CDR_RDATA_MST_Pos)    /*!< 0x00000400 */
#define ADC1_CDR_RDATA_MST_11           (0x0800UL << ADC1_CDR_RDATA_MST_Pos)    /*!< 0x00000800 */
#define ADC1_CDR_RDATA_MST_12           (0x1000UL << ADC1_CDR_RDATA_MST_Pos)    /*!< 0x00001000 */
#define ADC1_CDR_RDATA_MST_13           (0x2000UL << ADC1_CDR_RDATA_MST_Pos)    /*!< 0x00002000 */
#define ADC1_CDR_RDATA_MST_14           (0x4000UL << ADC1_CDR_RDATA_MST_Pos)    /*!< 0x00004000 */
#define ADC1_CDR_RDATA_MST_15           (0x8000UL << ADC1_CDR_RDATA_MST_Pos)    /*!< 0x00008000 */

#define ADC1_CDR_RDATA_SLV_Pos          (16U)                                  
#define ADC1_CDR_RDATA_SLV_Msk          (0xFFFFUL << ADC1_CDR_RDATA_SLV_Pos)    /*!< 0xFFFF0000 */
#define ADC1_CDR_RDATA_SLV              ADC1_CDR_RDATA_SLV_Msk                 /*!< Regular Data of the master ADC */
#define ADC1_CDR_RDATA_SLV_0            (0x0001UL << ADC1_CDR_RDATA_SLV_Pos)    /*!< 0x00010000 */
#define ADC1_CDR_RDATA_SLV_1            (0x0002UL << ADC1_CDR_RDATA_SLV_Pos)    /*!< 0x00020000 */
#define ADC1_CDR_RDATA_SLV_2            (0x0004UL << ADC1_CDR_RDATA_SLV_Pos)    /*!< 0x00040000 */
#define ADC1_CDR_RDATA_SLV_3            (0x0008UL << ADC1_CDR_RDATA_SLV_Pos)    /*!< 0x00080000 */
#define ADC1_CDR_RDATA_SLV_4            (0x0010UL << ADC1_CDR_RDATA_SLV_Pos)    /*!< 0x00100000 */
#define ADC1_CDR_RDATA_SLV_5            (0x0020UL << ADC1_CDR_RDATA_SLV_Pos)    /*!< 0x00200000 */
#define ADC1_CDR_RDATA_SLV_6            (0x0040UL << ADC1_CDR_RDATA_SLV_Pos)    /*!< 0x00400000 */
#define ADC1_CDR_RDATA_SLV_7            (0x0080UL << ADC1_CDR_RDATA_SLV_Pos)    /*!< 0x00800000 */
#define ADC1_CDR_RDATA_SLV_8            (0x0100UL << ADC1_CDR_RDATA_SLV_Pos)    /*!< 0x01000000 */
#define ADC1_CDR_RDATA_SLV_9            (0x0200UL << ADC1_CDR_RDATA_SLV_Pos)    /*!< 0x02000000 */
#define ADC1_CDR_RDATA_SLV_10           (0x0400UL << ADC1_CDR_RDATA_SLV_Pos)    /*!< 0x04000000 */
#define ADC1_CDR_RDATA_SLV_11           (0x0800UL << ADC1_CDR_RDATA_SLV_Pos)    /*!< 0x08000000 */
#define ADC1_CDR_RDATA_SLV_12           (0x1000UL << ADC1_CDR_RDATA_SLV_Pos)    /*!< 0x10000000 */
#define ADC1_CDR_RDATA_SLV_13           (0x2000UL << ADC1_CDR_RDATA_SLV_Pos)    /*!< 0x20000000 */
#define ADC1_CDR_RDATA_SLV_14           (0x4000UL << ADC1_CDR_RDATA_SLV_Pos)    /*!< 0x40000000 */
#define ADC1_CDR_RDATA_SLV_15           (0x8000UL << ADC1_CDR_RDATA_SLV_Pos)    /*!< 0x80000000 */

/********************  Bit definition for ADC_CSR register  *******************/
#define ADC_CSR_ADRDY_MST_Pos          (0U)                                    
#define ADC_CSR_ADRDY_MST_Msk          (0x1UL << ADC_CSR_ADRDY_MST_Pos)         /*!< 0x00000001 */
#define ADC_CSR_ADRDY_MST              ADC_CSR_ADRDY_MST_Msk                   /*!< ADC multimode master ready flag */
#define ADC_CSR_EOSMP_MST_Pos          (1U)                                    
#define ADC_CSR_EOSMP_MST_Msk          (0x1UL << ADC_CSR_EOSMP_MST_Pos)         /*!< 0x00000002 */
#define ADC_CSR_EOSMP_MST              ADC_CSR_EOSMP_MST_Msk                   /*!< ADC multimode master group regular end of sampling flag */
#define ADC_CSR_EOC_MST_Pos            (2U)                                    
#define ADC_CSR_EOC_MST_Msk            (0x1UL << ADC_CSR_EOC_MST_Pos)           /*!< 0x00000004 */
#define ADC_CSR_EOC_MST                ADC_CSR_EOC_MST_Msk                     /*!< ADC multimode master group regular end of unitary conversion flag */
#define ADC_CSR_EOS_MST_Pos            (3U)                                    
#define ADC_CSR_EOS_MST_Msk            (0x1UL << ADC_CSR_EOS_MST_Pos)           /*!< 0x00000008 */
#define ADC_CSR_EOS_MST                ADC_CSR_EOS_MST_Msk                     /*!< ADC multimode master group regular end of sequence conversions flag */
#define ADC_CSR_OVR_MST_Pos            (4U)                                    
#define ADC_CSR_OVR_MST_Msk            (0x1UL << ADC_CSR_OVR_MST_Pos)           /*!< 0x00000010 */
#define ADC_CSR_OVR_MST                ADC_CSR_OVR_MST_Msk                     /*!< ADC multimode master group regular overrun flag */
#define ADC_CSR_JEOC_MST_Pos           (5U)                                    
#define ADC_CSR_JEOC_MST_Msk           (0x1UL << ADC_CSR_JEOC_MST_Pos)          /*!< 0x00000020 */
#define ADC_CSR_JEOC_MST               ADC_CSR_JEOC_MST_Msk                    /*!< ADC multimode master group injected end of unitary conversion flag */
#define ADC_CSR_JEOS_MST_Pos           (6U)                                    
#define ADC_CSR_JEOS_MST_Msk           (0x1UL << ADC_CSR_JEOS_MST_Pos)          /*!< 0x00000040 */
#define ADC_CSR_JEOS_MST               ADC_CSR_JEOS_MST_Msk                    /*!< ADC multimode master group injected end of sequence conversions flag */
#define ADC_CSR_AWD1_MST_Pos           (7U)                                    
#define ADC_CSR_AWD1_MST_Msk           (0x1UL << ADC_CSR_AWD1_MST_Pos)          /*!< 0x00000080 */
#define ADC_CSR_AWD1_MST               ADC_CSR_AWD1_MST_Msk                    /*!< ADC multimode master analog watchdog 1 flag */
#define ADC_CSR_AWD2_MST_Pos           (8U)                                    
#define ADC_CSR_AWD2_MST_Msk           (0x1UL << ADC_CSR_AWD2_MST_Pos)          /*!< 0x00000100 */
#define ADC_CSR_AWD2_MST               ADC_CSR_AWD2_MST_Msk                    /*!< ADC multimode master analog watchdog 2 flag */
#define ADC_CSR_AWD3_MST_Pos           (9U)                                    
#define ADC_CSR_AWD3_MST_Msk           (0x1UL << ADC_CSR_AWD3_MST_Pos)          /*!< 0x00000200 */
#define ADC_CSR_AWD3_MST               ADC_CSR_AWD3_MST_Msk                    /*!< ADC multimode master analog watchdog 3 flag */
#define ADC_CSR_JQOVF_MST_Pos          (10U)                                   
#define ADC_CSR_JQOVF_MST_Msk          (0x1UL << ADC_CSR_JQOVF_MST_Pos)         /*!< 0x00000400 */
#define ADC_CSR_JQOVF_MST              ADC_CSR_JQOVF_MST_Msk                   /*!< ADC multimode master group injected contexts queue overflow flag */

#define ADC_CSR_ADRDY_SLV_Pos          (16U)                                   
#define ADC_CSR_ADRDY_SLV_Msk          (0x1UL << ADC_CSR_ADRDY_SLV_Pos)         /*!< 0x00010000 */
#define ADC_CSR_ADRDY_SLV              ADC_CSR_ADRDY_SLV_Msk                   /*!< ADC multimode slave ready flag */
#define ADC_CSR_EOSMP_SLV_Pos          (17U)                                   
#define ADC_CSR_EOSMP_SLV_Msk          (0x1UL << ADC_CSR_EOSMP_SLV_Pos)         /*!< 0x00020000 */
#define ADC_CSR_EOSMP_SLV              ADC_CSR_EOSMP_SLV_Msk                   /*!< ADC multimode slave group regular end of sampling flag */
#define ADC_CSR_EOC_SLV_Pos            (18U)                                   
#define ADC_CSR_EOC_SLV_Msk            (0x1UL << ADC_CSR_EOC_SLV_Pos)           /*!< 0x00040000 */
#define ADC_CSR_EOC_SLV                ADC_CSR_EOC_SLV_Msk                     /*!< ADC multimode slave group regular end of unitary conversion flag */
#define ADC_CSR_EOS_SLV_Pos            (19U)                                   
#define ADC_CSR_EOS_SLV_Msk            (0x1UL << ADC_CSR_EOS_SLV_Pos)           /*!< 0x00080000 */
#define ADC_CSR_EOS_SLV                ADC_CSR_EOS_SLV_Msk                     /*!< ADC multimode slave group regular end of sequence conversions flag */
#define ADC_CSR_OVR_SLV_Pos            (20U)                                   
#define ADC_CSR_OVR_SLV_Msk            (0x1UL << ADC_CSR_OVR_SLV_Pos)           /*!< 0x00100000 */
#define ADC_CSR_OVR_SLV                ADC_CSR_OVR_SLV_Msk                     /*!< ADC multimode slave group regular overrun flag */
#define ADC_CSR_JEOC_SLV_Pos           (21U)                                   
#define ADC_CSR_JEOC_SLV_Msk           (0x1UL << ADC_CSR_JEOC_SLV_Pos)          /*!< 0x00200000 */
#define ADC_CSR_JEOC_SLV               ADC_CSR_JEOC_SLV_Msk                    /*!< ADC multimode slave group injected end of unitary conversion flag */
#define ADC_CSR_JEOS_SLV_Pos           (22U)                                   
#define ADC_CSR_JEOS_SLV_Msk           (0x1UL << ADC_CSR_JEOS_SLV_Pos)          /*!< 0x00400000 */
#define ADC_CSR_JEOS_SLV               ADC_CSR_JEOS_SLV_Msk                    /*!< ADC multimode slave group injected end of sequence conversions flag */
#define ADC_CSR_AWD1_SLV_Pos           (23U)                                   
#define ADC_CSR_AWD1_SLV_Msk           (0x1UL << ADC_CSR_AWD1_SLV_Pos)          /*!< 0x00800000 */
#define ADC_CSR_AWD1_SLV               ADC_CSR_AWD1_SLV_Msk                    /*!< ADC multimode slave analog watchdog 1 flag */
#define ADC_CSR_AWD2_SLV_Pos           (24U)                                   
#define ADC_CSR_AWD2_SLV_Msk           (0x1UL << ADC_CSR_AWD2_SLV_Pos)          /*!< 0x01000000 */
#define ADC_CSR_AWD2_SLV               ADC_CSR_AWD2_SLV_Msk                    /*!< ADC multimode slave analog watchdog 2 flag */
#define ADC_CSR_AWD3_SLV_Pos           (25U)                                   
#define ADC_CSR_AWD3_SLV_Msk           (0x1UL << ADC_CSR_AWD3_SLV_Pos)          /*!< 0x02000000 */
#define ADC_CSR_AWD3_SLV               ADC_CSR_AWD3_SLV_Msk                    /*!< ADC multimode slave analog watchdog 3 flag */
#define ADC_CSR_JQOVF_SLV_Pos          (26U)                                   
#define ADC_CSR_JQOVF_SLV_Msk          (0x1UL << ADC_CSR_JQOVF_SLV_Pos)         /*!< 0x04000000 */
#define ADC_CSR_JQOVF_SLV              ADC_CSR_JQOVF_SLV_Msk                   /*!< ADC multimode slave group injected contexts queue overflow flag */

